HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxSbcu_bf.h
/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_OFF (2)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.HSSL */
#define IFX_SBCU_DBGRNT_HSSL_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.HSSL */
#define IFX_SBCU_DBGRNT_HSSL_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.HSSL */
#define IFX_SBCU_DBGRNT_HSSL_OFF (3)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE0 */
#define IFX_SBCU_DBGRNT_ONE0_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE0 */
#define IFX_SBCU_DBGRNT_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE0 */
#define IFX_SBCU_DBGRNT_ONE0_OFF (1)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE1 */
#define IFX_SBCU_DBGRNT_ONE1_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE1 */
#define IFX_SBCU_DBGRNT_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE1 */
#define IFX_SBCU_DBGRNT_ONE1_OFF (4)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE2 */
#define IFX_SBCU_DBGRNT_ONE2_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE2 */
#define IFX_SBCU_DBGRNT_ONE2_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE2 */
#define IFX_SBCU_DBGRNT_ONE2_OFF (6)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE3 */
#define IFX_SBCU_DBGRNT_ONE3_LEN (5)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE3 */
#define IFX_SBCU_DBGRNT_ONE3_MSK (0x1f)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE3 */
#define IFX_SBCU_DBGRNT_ONE3_OFF (9)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ONE4 */
#define IFX_SBCU_DBGRNT_ONE4_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.ONE4 */
#define IFX_SBCU_DBGRNT_ONE4_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.ONE4 */
#define IFX_SBCU_DBGRNT_ONE4_OFF (14)

/** \\brief  Length for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_LEN (32)

/** \\brief  Mask for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_OFF (0)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_OFF (16)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_LEN (2)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_MSK (0x3)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_OFF (17)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_LEN (14)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_MSK (0x3fff)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_OFF (0)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_LEN (4)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_OFF (28)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_OFF (21)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_OFF (15)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_OFF (19)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_LEN (6)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_MSK (0x3f)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_OFF (22)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_OFF (14)

/** \\brief  Length for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_LEN (1)

/** \\brief  Mask for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_OFF (20)

/** \\brief  Length for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_LEN (32)

/** \\brief  Mask for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_OFF (0)

/** \\brief  Length for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_LEN (8)

/** \\brief  Mask for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_MSK (0xff)

/** \\brief  Offset for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_OFF (8)

/** \\brief  Length for Ifx_SBCU_ID_Bits.MODREV */
#define IFX_SBCU_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_SBCU_ID_Bits.MODREV */
#define IFX_SBCU_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_SBCU_ID_Bits.MODREV */
#define IFX_SBCU_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.CPU1 */
#define IFX_SBCU_PRIOH_CPU1_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.CPU1 */
#define IFX_SBCU_PRIOH_CPU1_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.CPU1 */
#define IFX_SBCU_PRIOH_CPU1_OFF (0)

/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_OFF (28)

